MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/pps.h
/*
 * Component description for PPS
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-10-17T09:05:02Z */
#ifndef _BZ45_PPS_COMPONENT_H_
#define _BZ45_PPS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PPS                                          */
/* ************************************************************************** */

/* -------- PPS_EXTINT0R : (PPS Offset: 0x00) (R/W 32)  -------- */
#define PPS_EXTINT0R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_EXTINT0R)   Reset Value */

#define PPS_EXTINT0R_EXTINT0_Pos              _UINT32_(0)                                          /* (PPS_EXTINT0R) EXTINT0 Position */
#define PPS_EXTINT0R_EXTINT0_Msk              (_UINT32_(0xF) << PPS_EXTINT0R_EXTINT0_Pos)          /* (PPS_EXTINT0R) EXTINT0 Mask */
#define PPS_EXTINT0R_EXTINT0(value)           (PPS_EXTINT0R_EXTINT0_Msk & (_UINT32_(value) << PPS_EXTINT0R_EXTINT0_Pos)) /* Assigment of value for EXTINT0 in the PPS_EXTINT0R register */
#define   PPS_EXTINT0R_EXTINT0_RPA9_Val       _UINT32_(0xF)                                        /* (PPS_EXTINT0R) RPA9  */
#define   PPS_EXTINT0R_EXTINT0_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_EXTINT0R) RPA3  */
#define   PPS_EXTINT0R_EXTINT0_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_EXTINT0R) RPA7  */
#define   PPS_EXTINT0R_EXTINT0_RPA11_Val      _UINT32_(0x3)                                        /* (PPS_EXTINT0R) RPA11  */
#define   PPS_EXTINT0R_EXTINT0_RPB0_Val       _UINT32_(0x4)                                        /* (PPS_EXTINT0R) RPB0  */
#define   PPS_EXTINT0R_EXTINT0_RPB4_Val       _UINT32_(0x5)                                        /* (PPS_EXTINT0R) RPB4  */
#define   PPS_EXTINT0R_EXTINT0_RPB8_Val       _UINT32_(0x6)                                        /* (PPS_EXTINT0R) RPB8  */
#define   PPS_EXTINT0R_EXTINT0_RPB12_Val      _UINT32_(0x7)                                        /* (PPS_EXTINT0R) RPB12  */
#define   PPS_EXTINT0R_EXTINT0_RPA2_Val       _UINT32_(0x8)                                        /* (PPS_EXTINT0R) RPA2  */
#define   PPS_EXTINT0R_EXTINT0_RPA6_Val       _UINT32_(0x9)                                        /* (PPS_EXTINT0R) RPA6  */
#define   PPS_EXTINT0R_EXTINT0_RPA10_Val      _UINT32_(0xA)                                        /* (PPS_EXTINT0R) RPA10  */
#define   PPS_EXTINT0R_EXTINT0_RPA14_Val      _UINT32_(0xB)                                        /* (PPS_EXTINT0R) RPA14  */
#define   PPS_EXTINT0R_EXTINT0_RPB3_Val       _UINT32_(0xC)                                        /* (PPS_EXTINT0R) RPB3  */
#define   PPS_EXTINT0R_EXTINT0_RPB7_Val       _UINT32_(0xD)                                        /* (PPS_EXTINT0R) RPB7  */
#define   PPS_EXTINT0R_EXTINT0_RPB11_Val      _UINT32_(0xE)                                        /* (PPS_EXTINT0R) RPB11  */
#define   PPS_EXTINT0R_EXTINT0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_EXTINT0R) OFF  */
#define PPS_EXTINT0R_EXTINT0_RPA9             (PPS_EXTINT0R_EXTINT0_RPA9_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPA9 Position  */
#define PPS_EXTINT0R_EXTINT0_RPA3             (PPS_EXTINT0R_EXTINT0_RPA3_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPA3 Position  */
#define PPS_EXTINT0R_EXTINT0_RPA7             (PPS_EXTINT0R_EXTINT0_RPA7_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPA7 Position  */
#define PPS_EXTINT0R_EXTINT0_RPA11            (PPS_EXTINT0R_EXTINT0_RPA11_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPA11 Position  */
#define PPS_EXTINT0R_EXTINT0_RPB0             (PPS_EXTINT0R_EXTINT0_RPB0_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPB0 Position  */
#define PPS_EXTINT0R_EXTINT0_RPB4             (PPS_EXTINT0R_EXTINT0_RPB4_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPB4 Position  */
#define PPS_EXTINT0R_EXTINT0_RPB8             (PPS_EXTINT0R_EXTINT0_RPB8_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPB8 Position  */
#define PPS_EXTINT0R_EXTINT0_RPB12            (PPS_EXTINT0R_EXTINT0_RPB12_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPB12 Position  */
#define PPS_EXTINT0R_EXTINT0_RPA2             (PPS_EXTINT0R_EXTINT0_RPA2_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPA2 Position  */
#define PPS_EXTINT0R_EXTINT0_RPA6             (PPS_EXTINT0R_EXTINT0_RPA6_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPA6 Position  */
#define PPS_EXTINT0R_EXTINT0_RPA10            (PPS_EXTINT0R_EXTINT0_RPA10_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPA10 Position  */
#define PPS_EXTINT0R_EXTINT0_RPA14            (PPS_EXTINT0R_EXTINT0_RPA14_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPA14 Position  */
#define PPS_EXTINT0R_EXTINT0_RPB3             (PPS_EXTINT0R_EXTINT0_RPB3_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPB3 Position  */
#define PPS_EXTINT0R_EXTINT0_RPB7             (PPS_EXTINT0R_EXTINT0_RPB7_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPB7 Position  */
#define PPS_EXTINT0R_EXTINT0_RPB11            (PPS_EXTINT0R_EXTINT0_RPB11_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) RPB11 Position  */
#define PPS_EXTINT0R_EXTINT0_OFF              (PPS_EXTINT0R_EXTINT0_OFF_Val << PPS_EXTINT0R_EXTINT0_Pos) /* (PPS_EXTINT0R) OFF Position  */
#define PPS_EXTINT0R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_EXTINT0R) Register Mask  */


/* -------- PPS_EXTINT1R : (PPS Offset: 0x04) (R/W 32)  -------- */
#define PPS_EXTINT1R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_EXTINT1R)   Reset Value */

#define PPS_EXTINT1R_EXTINT1_Pos              _UINT32_(0)                                          /* (PPS_EXTINT1R) EXTINT1 Position */
#define PPS_EXTINT1R_EXTINT1_Msk              (_UINT32_(0xF) << PPS_EXTINT1R_EXTINT1_Pos)          /* (PPS_EXTINT1R) EXTINT1 Mask */
#define PPS_EXTINT1R_EXTINT1(value)           (PPS_EXTINT1R_EXTINT1_Msk & (_UINT32_(value) << PPS_EXTINT1R_EXTINT1_Pos)) /* Assigment of value for EXTINT1 in the PPS_EXTINT1R register */
#define   PPS_EXTINT1R_EXTINT1_RPA0_Val       _UINT32_(0xF)                                        /* (PPS_EXTINT1R) RPA0  */
#define   PPS_EXTINT1R_EXTINT1_RPA4_Val       _UINT32_(0x1)                                        /* (PPS_EXTINT1R) RPA4  */
#define   PPS_EXTINT1R_EXTINT1_RPA8_Val       _UINT32_(0x2)                                        /* (PPS_EXTINT1R) RPA8  */
#define   PPS_EXTINT1R_EXTINT1_RPA12_Val      _UINT32_(0x3)                                        /* (PPS_EXTINT1R) RPA12  */
#define   PPS_EXTINT1R_EXTINT1_RPB1_Val       _UINT32_(0x4)                                        /* (PPS_EXTINT1R) RPB1  */
#define   PPS_EXTINT1R_EXTINT1_RPB5_Val       _UINT32_(0x5)                                        /* (PPS_EXTINT1R) RPB5  */
#define   PPS_EXTINT1R_EXTINT1_RPB9_Val       _UINT32_(0x6)                                        /* (PPS_EXTINT1R) RPB9  */
#define   PPS_EXTINT1R_EXTINT1_RPB13_Val      _UINT32_(0x7)                                        /* (PPS_EXTINT1R) RPB13  */
#define   PPS_EXTINT1R_EXTINT1_RPA3_Val       _UINT32_(0x8)                                        /* (PPS_EXTINT1R) RPA3  */
#define   PPS_EXTINT1R_EXTINT1_RPA7_Val       _UINT32_(0x9)                                        /* (PPS_EXTINT1R) RPA7  */
#define   PPS_EXTINT1R_EXTINT1_RPA11_Val      _UINT32_(0xA)                                        /* (PPS_EXTINT1R) RPA11  */
#define   PPS_EXTINT1R_EXTINT1_RPB0_Val       _UINT32_(0xB)                                        /* (PPS_EXTINT1R) RPB0  */
#define   PPS_EXTINT1R_EXTINT1_RPB4_Val       _UINT32_(0xC)                                        /* (PPS_EXTINT1R) RPB4  */
#define   PPS_EXTINT1R_EXTINT1_RPB8_Val       _UINT32_(0xD)                                        /* (PPS_EXTINT1R) RPB8  */
#define   PPS_EXTINT1R_EXTINT1_RPB12_Val      _UINT32_(0xE)                                        /* (PPS_EXTINT1R) RPB12  */
#define   PPS_EXTINT1R_EXTINT1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_EXTINT1R) OFF  */
#define PPS_EXTINT1R_EXTINT1_RPA0             (PPS_EXTINT1R_EXTINT1_RPA0_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPA0 Position  */
#define PPS_EXTINT1R_EXTINT1_RPA4             (PPS_EXTINT1R_EXTINT1_RPA4_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPA4 Position  */
#define PPS_EXTINT1R_EXTINT1_RPA8             (PPS_EXTINT1R_EXTINT1_RPA8_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPA8 Position  */
#define PPS_EXTINT1R_EXTINT1_RPA12            (PPS_EXTINT1R_EXTINT1_RPA12_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPA12 Position  */
#define PPS_EXTINT1R_EXTINT1_RPB1             (PPS_EXTINT1R_EXTINT1_RPB1_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPB1 Position  */
#define PPS_EXTINT1R_EXTINT1_RPB5             (PPS_EXTINT1R_EXTINT1_RPB5_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPB5 Position  */
#define PPS_EXTINT1R_EXTINT1_RPB9             (PPS_EXTINT1R_EXTINT1_RPB9_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPB9 Position  */
#define PPS_EXTINT1R_EXTINT1_RPB13            (PPS_EXTINT1R_EXTINT1_RPB13_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPB13 Position  */
#define PPS_EXTINT1R_EXTINT1_RPA3             (PPS_EXTINT1R_EXTINT1_RPA3_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPA3 Position  */
#define PPS_EXTINT1R_EXTINT1_RPA7             (PPS_EXTINT1R_EXTINT1_RPA7_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPA7 Position  */
#define PPS_EXTINT1R_EXTINT1_RPA11            (PPS_EXTINT1R_EXTINT1_RPA11_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPA11 Position  */
#define PPS_EXTINT1R_EXTINT1_RPB0             (PPS_EXTINT1R_EXTINT1_RPB0_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPB0 Position  */
#define PPS_EXTINT1R_EXTINT1_RPB4             (PPS_EXTINT1R_EXTINT1_RPB4_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPB4 Position  */
#define PPS_EXTINT1R_EXTINT1_RPB8             (PPS_EXTINT1R_EXTINT1_RPB8_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPB8 Position  */
#define PPS_EXTINT1R_EXTINT1_RPB12            (PPS_EXTINT1R_EXTINT1_RPB12_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) RPB12 Position  */
#define PPS_EXTINT1R_EXTINT1_OFF              (PPS_EXTINT1R_EXTINT1_OFF_Val << PPS_EXTINT1R_EXTINT1_Pos) /* (PPS_EXTINT1R) OFF Position  */
#define PPS_EXTINT1R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_EXTINT1R) Register Mask  */


/* -------- PPS_EXTINT2R : (PPS Offset: 0x08) (R/W 32)  -------- */
#define PPS_EXTINT2R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_EXTINT2R)   Reset Value */

