MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/pps.h
#define PPS_EXTINT2R_EXTINT2_Pos              _UINT32_(0)                                          /* (PPS_EXTINT2R) EXTINT2 Position */
#define PPS_EXTINT2R_EXTINT2_Msk              (_UINT32_(0xF) << PPS_EXTINT2R_EXTINT2_Pos)          /* (PPS_EXTINT2R) EXTINT2 Mask */
#define PPS_EXTINT2R_EXTINT2(value)           (PPS_EXTINT2R_EXTINT2_Msk & (_UINT32_(value) << PPS_EXTINT2R_EXTINT2_Pos)) /* Assigment of value for EXTINT2 in the PPS_EXTINT2R register */
#define   PPS_EXTINT2R_EXTINT2_RPA1_Val       _UINT32_(0xF)                                        /* (PPS_EXTINT2R) RPA1  */
#define   PPS_EXTINT2R_EXTINT2_RPA5_Val       _UINT32_(0x1)                                        /* (PPS_EXTINT2R) RPA5  */
#define   PPS_EXTINT2R_EXTINT2_RPA9_Val       _UINT32_(0x2)                                        /* (PPS_EXTINT2R) RPA9  */
#define   PPS_EXTINT2R_EXTINT2_RPA13_Val      _UINT32_(0x3)                                        /* (PPS_EXTINT2R) RPA13  */
#define   PPS_EXTINT2R_EXTINT2_RPB2_Val       _UINT32_(0x4)                                        /* (PPS_EXTINT2R) RPB2  */
#define   PPS_EXTINT2R_EXTINT2_RPB6_Val       _UINT32_(0x5)                                        /* (PPS_EXTINT2R) RPB6  */
#define   PPS_EXTINT2R_EXTINT2_RPB10_Val      _UINT32_(0x6)                                        /* (PPS_EXTINT2R) RPB10  */
#define   PPS_EXTINT2R_EXTINT2_RPA0_Val       _UINT32_(0x7)                                        /* (PPS_EXTINT2R) RPA0  */
#define   PPS_EXTINT2R_EXTINT2_RPA4_Val       _UINT32_(0x8)                                        /* (PPS_EXTINT2R) RPA4  */
#define   PPS_EXTINT2R_EXTINT2_RPA8_Val       _UINT32_(0x9)                                        /* (PPS_EXTINT2R) RPA8  */
#define   PPS_EXTINT2R_EXTINT2_RPA12_Val      _UINT32_(0xA)                                        /* (PPS_EXTINT2R) RPA12  */
#define   PPS_EXTINT2R_EXTINT2_RPB1_Val       _UINT32_(0xB)                                        /* (PPS_EXTINT2R) RPB1  */
#define   PPS_EXTINT2R_EXTINT2_RPB5_Val       _UINT32_(0xC)                                        /* (PPS_EXTINT2R) RPB5  */
#define   PPS_EXTINT2R_EXTINT2_RPB9_Val       _UINT32_(0xD)                                        /* (PPS_EXTINT2R) RPB9  */
#define   PPS_EXTINT2R_EXTINT2_RPB13_Val      _UINT32_(0xE)                                        /* (PPS_EXTINT2R) RPB13  */
#define   PPS_EXTINT2R_EXTINT2_OFF_Val        _UINT32_(0x0)                                        /* (PPS_EXTINT2R) OFF  */
#define PPS_EXTINT2R_EXTINT2_RPA1             (PPS_EXTINT2R_EXTINT2_RPA1_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA1 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA5             (PPS_EXTINT2R_EXTINT2_RPA5_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA5 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA9             (PPS_EXTINT2R_EXTINT2_RPA9_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA9 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA13            (PPS_EXTINT2R_EXTINT2_RPA13_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA13 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB2             (PPS_EXTINT2R_EXTINT2_RPB2_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB2 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB6             (PPS_EXTINT2R_EXTINT2_RPB6_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB6 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB10            (PPS_EXTINT2R_EXTINT2_RPB10_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB10 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA0             (PPS_EXTINT2R_EXTINT2_RPA0_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA0 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA4             (PPS_EXTINT2R_EXTINT2_RPA4_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA4 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA8             (PPS_EXTINT2R_EXTINT2_RPA8_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA8 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA12            (PPS_EXTINT2R_EXTINT2_RPA12_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA12 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB1             (PPS_EXTINT2R_EXTINT2_RPB1_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB1 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB5             (PPS_EXTINT2R_EXTINT2_RPB5_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB5 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB9             (PPS_EXTINT2R_EXTINT2_RPB9_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB9 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB13            (PPS_EXTINT2R_EXTINT2_RPB13_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB13 Position  */
#define PPS_EXTINT2R_EXTINT2_OFF              (PPS_EXTINT2R_EXTINT2_OFF_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) OFF Position  */
#define PPS_EXTINT2R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_EXTINT2R) Register Mask  */


/* -------- PPS_EXTINT3R : (PPS Offset: 0x0C) (R/W 32)  -------- */
#define PPS_EXTINT3R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_EXTINT3R)   Reset Value */

#define PPS_EXTINT3R_EXTINT3_Pos              _UINT32_(0)                                          /* (PPS_EXTINT3R) EXTINT3 Position */
#define PPS_EXTINT3R_EXTINT3_Msk              (_UINT32_(0xF) << PPS_EXTINT3R_EXTINT3_Pos)          /* (PPS_EXTINT3R) EXTINT3 Mask */
#define PPS_EXTINT3R_EXTINT3(value)           (PPS_EXTINT3R_EXTINT3_Msk & (_UINT32_(value) << PPS_EXTINT3R_EXTINT3_Pos)) /* Assigment of value for EXTINT3 in the PPS_EXTINT3R register */
#define   PPS_EXTINT3R_EXTINT3_RPA2_Val       _UINT32_(0xF)                                        /* (PPS_EXTINT3R) RPA2  */
#define   PPS_EXTINT3R_EXTINT3_RPA6_Val       _UINT32_(0x1)                                        /* (PPS_EXTINT3R) RPA6  */
#define   PPS_EXTINT3R_EXTINT3_RPA10_Val      _UINT32_(0x2)                                        /* (PPS_EXTINT3R) RPA10  */
#define   PPS_EXTINT3R_EXTINT3_RPA14_Val      _UINT32_(0x3)                                        /* (PPS_EXTINT3R) RPA14  */
#define   PPS_EXTINT3R_EXTINT3_RPB3_Val       _UINT32_(0x4)                                        /* (PPS_EXTINT3R) RPB3  */
#define   PPS_EXTINT3R_EXTINT3_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_EXTINT3R) RPB7  */
#define   PPS_EXTINT3R_EXTINT3_RPB11_Val      _UINT32_(0x6)                                        /* (PPS_EXTINT3R) RPB11  */
#define   PPS_EXTINT3R_EXTINT3_RPA1_Val       _UINT32_(0x7)                                        /* (PPS_EXTINT3R) RPA1  */
#define   PPS_EXTINT3R_EXTINT3_RPA5_Val       _UINT32_(0x8)                                        /* (PPS_EXTINT3R) RPA5  */
#define   PPS_EXTINT3R_EXTINT3_RPA9_Val       _UINT32_(0x9)                                        /* (PPS_EXTINT3R) RPA9  */
#define   PPS_EXTINT3R_EXTINT3_RPA13_Val      _UINT32_(0xA)                                        /* (PPS_EXTINT3R) RPA13  */
#define   PPS_EXTINT3R_EXTINT3_RPB2_Val       _UINT32_(0xB)                                        /* (PPS_EXTINT3R) RPB2  */
#define   PPS_EXTINT3R_EXTINT3_RPB6_Val       _UINT32_(0xC)                                        /* (PPS_EXTINT3R) RPB6  */
#define   PPS_EXTINT3R_EXTINT3_RPB10_Val      _UINT32_(0xD)                                        /* (PPS_EXTINT3R) RPB10  */
#define   PPS_EXTINT3R_EXTINT3_RPA8_Val       _UINT32_(0xE)                                        /* (PPS_EXTINT3R) RPA8  */
#define   PPS_EXTINT3R_EXTINT3_OFF_Val        _UINT32_(0x0)                                        /* (PPS_EXTINT3R) OFF  */
#define PPS_EXTINT3R_EXTINT3_RPA2             (PPS_EXTINT3R_EXTINT3_RPA2_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA2 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA6             (PPS_EXTINT3R_EXTINT3_RPA6_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA6 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA10            (PPS_EXTINT3R_EXTINT3_RPA10_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA10 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA14            (PPS_EXTINT3R_EXTINT3_RPA14_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA14 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB3             (PPS_EXTINT3R_EXTINT3_RPB3_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB3 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB7             (PPS_EXTINT3R_EXTINT3_RPB7_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB7 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB11            (PPS_EXTINT3R_EXTINT3_RPB11_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB11 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA1             (PPS_EXTINT3R_EXTINT3_RPA1_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA1 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA5             (PPS_EXTINT3R_EXTINT3_RPA5_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA5 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA9             (PPS_EXTINT3R_EXTINT3_RPA9_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA9 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA13            (PPS_EXTINT3R_EXTINT3_RPA13_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA13 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB2             (PPS_EXTINT3R_EXTINT3_RPB2_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB2 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB6             (PPS_EXTINT3R_EXTINT3_RPB6_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB6 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB10            (PPS_EXTINT3R_EXTINT3_RPB10_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB10 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA8             (PPS_EXTINT3R_EXTINT3_RPA8_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA8 Position  */
#define PPS_EXTINT3R_EXTINT3_OFF              (PPS_EXTINT3R_EXTINT3_OFF_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) OFF Position  */
#define PPS_EXTINT3R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_EXTINT3R) Register Mask  */


