MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/pps.h
#define PPS_SCOM2P3R_SCOM2P3_Pos              _UINT32_(0)                                          /* (PPS_SCOM2P3R) SERCOM2/PAD3 Position */
#define PPS_SCOM2P3R_SCOM2P3_Msk              (_UINT32_(0xF) << PPS_SCOM2P3R_SCOM2P3_Pos)          /* (PPS_SCOM2P3R) SERCOM2/PAD3 Mask */
#define PPS_SCOM2P3R_SCOM2P3(value)           (PPS_SCOM2P3R_SCOM2P3_Msk & (_UINT32_(value) << PPS_SCOM2P3R_SCOM2P3_Pos)) /* Assigment of value for SCOM2P3 in the PPS_SCOM2P3R register */
#define   PPS_SCOM2P3R_SCOM2P3_RPA1_Val       _UINT32_(0xF)                                        /* (PPS_SCOM2P3R) RPA1  */
#define   PPS_SCOM2P3R_SCOM2P3_RPA5_Val       _UINT32_(0x1)                                        /* (PPS_SCOM2P3R) RPA5  */
#define   PPS_SCOM2P3R_SCOM2P3_RPA9_Val       _UINT32_(0x2)                                        /* (PPS_SCOM2P3R) RPA9  */
#define   PPS_SCOM2P3R_SCOM2P3_RPA13_Val      _UINT32_(0x3)                                        /* (PPS_SCOM2P3R) RPA13  */
#define   PPS_SCOM2P3R_SCOM2P3_RPB2_Val       _UINT32_(0x4)                                        /* (PPS_SCOM2P3R) RPB2  */
#define   PPS_SCOM2P3R_SCOM2P3_RPB6_Val       _UINT32_(0x5)                                        /* (PPS_SCOM2P3R) RPB6  */
#define   PPS_SCOM2P3R_SCOM2P3_RPB10_Val      _UINT32_(0x6)                                        /* (PPS_SCOM2P3R) RPB10  */
#define   PPS_SCOM2P3R_SCOM2P3_RPA0_Val       _UINT32_(0x7)                                        /* (PPS_SCOM2P3R) RPA0  */
#define   PPS_SCOM2P3R_SCOM2P3_RPA4_Val       _UINT32_(0x8)                                        /* (PPS_SCOM2P3R) RPA4  */
#define   PPS_SCOM2P3R_SCOM2P3_RPA8_Val       _UINT32_(0x9)                                        /* (PPS_SCOM2P3R) RPA8  */
#define   PPS_SCOM2P3R_SCOM2P3_RPA12_Val      _UINT32_(0xA)                                        /* (PPS_SCOM2P3R) RPA12  */
#define   PPS_SCOM2P3R_SCOM2P3_RPB1_Val       _UINT32_(0xB)                                        /* (PPS_SCOM2P3R) RPB1  */
#define   PPS_SCOM2P3R_SCOM2P3_RPB5_Val       _UINT32_(0xC)                                        /* (PPS_SCOM2P3R) RPB5  */
#define   PPS_SCOM2P3R_SCOM2P3_RPB9_Val       _UINT32_(0xD)                                        /* (PPS_SCOM2P3R) RPB9  */
#define   PPS_SCOM2P3R_SCOM2P3_RPB13_Val      _UINT32_(0xE)                                        /* (PPS_SCOM2P3R) RPB13  */
#define   PPS_SCOM2P3R_SCOM2P3_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM2P3R) OFF  */
#define PPS_SCOM2P3R_SCOM2P3_RPA1             (PPS_SCOM2P3R_SCOM2P3_RPA1_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPA1 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPA5             (PPS_SCOM2P3R_SCOM2P3_RPA5_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPA5 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPA9             (PPS_SCOM2P3R_SCOM2P3_RPA9_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPA9 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPA13            (PPS_SCOM2P3R_SCOM2P3_RPA13_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPA13 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPB2             (PPS_SCOM2P3R_SCOM2P3_RPB2_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPB2 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPB6             (PPS_SCOM2P3R_SCOM2P3_RPB6_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPB6 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPB10            (PPS_SCOM2P3R_SCOM2P3_RPB10_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPB10 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPA0             (PPS_SCOM2P3R_SCOM2P3_RPA0_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPA0 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPA4             (PPS_SCOM2P3R_SCOM2P3_RPA4_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPA4 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPA8             (PPS_SCOM2P3R_SCOM2P3_RPA8_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPA8 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPA12            (PPS_SCOM2P3R_SCOM2P3_RPA12_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPA12 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPB1             (PPS_SCOM2P3R_SCOM2P3_RPB1_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPB1 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPB5             (PPS_SCOM2P3R_SCOM2P3_RPB5_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPB5 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPB9             (PPS_SCOM2P3R_SCOM2P3_RPB9_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPB9 Position  */
#define PPS_SCOM2P3R_SCOM2P3_RPB13            (PPS_SCOM2P3R_SCOM2P3_RPB13_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) RPB13 Position  */
#define PPS_SCOM2P3R_SCOM2P3_OFF              (PPS_SCOM2P3R_SCOM2P3_OFF_Val << PPS_SCOM2P3R_SCOM2P3_Pos) /* (PPS_SCOM2P3R) OFF Position  */
#define PPS_SCOM2P3R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM2P3R) Register Mask  */


/* -------- PPS_SCOM3P0R : (PPS Offset: 0x70) (R/W 32)  -------- */
#define PPS_SCOM3P0R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM3P0R)   Reset Value */

#define PPS_SCOM3P0R_SCOM3P0_Pos              _UINT32_(0)                                          /* (PPS_SCOM3P0R) SERCOM3/PAD0 Position */
#define PPS_SCOM3P0R_SCOM3P0_Msk              (_UINT32_(0xF) << PPS_SCOM3P0R_SCOM3P0_Pos)          /* (PPS_SCOM3P0R) SERCOM3/PAD0 Mask */
#define PPS_SCOM3P0R_SCOM3P0(value)           (PPS_SCOM3P0R_SCOM3P0_Msk & (_UINT32_(value) << PPS_SCOM3P0R_SCOM3P0_Pos)) /* Assigment of value for SCOM3P0 in the PPS_SCOM3P0R register */
#define   PPS_SCOM3P0R_SCOM3P0_RPA9_Val       _UINT32_(0xF)                                        /* (PPS_SCOM3P0R) RPA9  */
#define   PPS_SCOM3P0R_SCOM3P0_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_SCOM3P0R) RPA3  */
#define   PPS_SCOM3P0R_SCOM3P0_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_SCOM3P0R) RPA7  */
#define   PPS_SCOM3P0R_SCOM3P0_RPA11_Val      _UINT32_(0x3)                                        /* (PPS_SCOM3P0R) RPA11  */
#define   PPS_SCOM3P0R_SCOM3P0_RPB0_Val       _UINT32_(0x4)                                        /* (PPS_SCOM3P0R) RPB0  */
#define   PPS_SCOM3P0R_SCOM3P0_RPB4_Val       _UINT32_(0x5)                                        /* (PPS_SCOM3P0R) RPB4  */
#define   PPS_SCOM3P0R_SCOM3P0_RPB8_Val       _UINT32_(0x6)                                        /* (PPS_SCOM3P0R) RPB8  */
#define   PPS_SCOM3P0R_SCOM3P0_RPB12_Val      _UINT32_(0x7)                                        /* (PPS_SCOM3P0R) RPB12  */
#define   PPS_SCOM3P0R_SCOM3P0_RPA2_Val       _UINT32_(0x8)                                        /* (PPS_SCOM3P0R) RPA2  */
#define   PPS_SCOM3P0R_SCOM3P0_RPA6_Val       _UINT32_(0x9)                                        /* (PPS_SCOM3P0R) RPA6  */
#define   PPS_SCOM3P0R_SCOM3P0_RPA10_Val      _UINT32_(0xA)                                        /* (PPS_SCOM3P0R) RPA10  */
#define   PPS_SCOM3P0R_SCOM3P0_RPA14_Val      _UINT32_(0xB)                                        /* (PPS_SCOM3P0R) RPA14  */
#define   PPS_SCOM3P0R_SCOM3P0_RPB3_Val       _UINT32_(0xC)                                        /* (PPS_SCOM3P0R) RPB3  */
#define   PPS_SCOM3P0R_SCOM3P0_RPB7_Val       _UINT32_(0xD)                                        /* (PPS_SCOM3P0R) RPB7  */
#define   PPS_SCOM3P0R_SCOM3P0_RPB11_Val      _UINT32_(0xE)                                        /* (PPS_SCOM3P0R) RPB11  */
#define   PPS_SCOM3P0R_SCOM3P0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM3P0R) OFF  */
#define PPS_SCOM3P0R_SCOM3P0_RPA9             (PPS_SCOM3P0R_SCOM3P0_RPA9_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPA9 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPA3             (PPS_SCOM3P0R_SCOM3P0_RPA3_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPA3 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPA7             (PPS_SCOM3P0R_SCOM3P0_RPA7_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPA7 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPA11            (PPS_SCOM3P0R_SCOM3P0_RPA11_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPA11 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPB0             (PPS_SCOM3P0R_SCOM3P0_RPB0_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPB0 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPB4             (PPS_SCOM3P0R_SCOM3P0_RPB4_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPB4 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPB8             (PPS_SCOM3P0R_SCOM3P0_RPB8_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPB8 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPB12            (PPS_SCOM3P0R_SCOM3P0_RPB12_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPB12 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPA2             (PPS_SCOM3P0R_SCOM3P0_RPA2_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPA2 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPA6             (PPS_SCOM3P0R_SCOM3P0_RPA6_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPA6 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPA10            (PPS_SCOM3P0R_SCOM3P0_RPA10_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPA10 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPA14            (PPS_SCOM3P0R_SCOM3P0_RPA14_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPA14 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPB3             (PPS_SCOM3P0R_SCOM3P0_RPB3_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPB3 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPB7             (PPS_SCOM3P0R_SCOM3P0_RPB7_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPB7 Position  */
#define PPS_SCOM3P0R_SCOM3P0_RPB11            (PPS_SCOM3P0R_SCOM3P0_RPB11_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) RPB11 Position  */
#define PPS_SCOM3P0R_SCOM3P0_OFF              (PPS_SCOM3P0R_SCOM3P0_OFF_Val << PPS_SCOM3P0R_SCOM3P0_Pos) /* (PPS_SCOM3P0R) OFF Position  */
#define PPS_SCOM3P0R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM3P0R) Register Mask  */


/* -------- PPS_SCOM3P1R : (PPS Offset: 0x74) (R/W 32)  -------- */
#define PPS_SCOM3P1R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM3P1R)   Reset Value */

#define PPS_SCOM3P1R_SCOM3P1_Pos              _UINT32_(0)                                          /* (PPS_SCOM3P1R) SERCOM3/PAD1 Position */
#define PPS_SCOM3P1R_SCOM3P1_Msk              (_UINT32_(0xF) << PPS_SCOM3P1R_SCOM3P1_Pos)          /* (PPS_SCOM3P1R) SERCOM3/PAD1 Mask */
#define PPS_SCOM3P1R_SCOM3P1(value)           (PPS_SCOM3P1R_SCOM3P1_Msk & (_UINT32_(value) << PPS_SCOM3P1R_SCOM3P1_Pos)) /* Assigment of value for SCOM3P1 in the PPS_SCOM3P1R register */
#define   PPS_SCOM3P1R_SCOM3P1_RPA0_Val       _UINT32_(0xF)                                        /* (PPS_SCOM3P1R) RPA0  */
#define   PPS_SCOM3P1R_SCOM3P1_RPA4_Val       _UINT32_(0x1)                                        /* (PPS_SCOM3P1R) RPA4  */
#define   PPS_SCOM3P1R_SCOM3P1_RPA8_Val       _UINT32_(0x2)                                        /* (PPS_SCOM3P1R) RPA8  */
#define   PPS_SCOM3P1R_SCOM3P1_RPA12_Val      _UINT32_(0x3)                                        /* (PPS_SCOM3P1R) RPA12  */
#define   PPS_SCOM3P1R_SCOM3P1_RPB1_Val       _UINT32_(0x4)                                        /* (PPS_SCOM3P1R) RPB1  */
#define   PPS_SCOM3P1R_SCOM3P1_RPB5_Val       _UINT32_(0x5)                                        /* (PPS_SCOM3P1R) RPB5  */
#define   PPS_SCOM3P1R_SCOM3P1_RPB9_Val       _UINT32_(0x6)                                        /* (PPS_SCOM3P1R) RPB9  */
#define   PPS_SCOM3P1R_SCOM3P1_RPB13_Val      _UINT32_(0x7)                                        /* (PPS_SCOM3P1R) RPB13  */
#define   PPS_SCOM3P1R_SCOM3P1_RPA3_Val       _UINT32_(0x8)                                        /* (PPS_SCOM3P1R) RPA3  */
#define   PPS_SCOM3P1R_SCOM3P1_RPA7_Val       _UINT32_(0x9)                                        /* (PPS_SCOM3P1R) RPA7  */
#define   PPS_SCOM3P1R_SCOM3P1_RPA11_Val      _UINT32_(0xA)                                        /* (PPS_SCOM3P1R) RPA11  */
#define   PPS_SCOM3P1R_SCOM3P1_RPB0_Val       _UINT32_(0xB)                                        /* (PPS_SCOM3P1R) RPB0  */
#define   PPS_SCOM3P1R_SCOM3P1_RPB4_Val       _UINT32_(0xC)                                        /* (PPS_SCOM3P1R) RPB4  */
#define   PPS_SCOM3P1R_SCOM3P1_RPB8_Val       _UINT32_(0xD)                                        /* (PPS_SCOM3P1R) RPB8  */
#define   PPS_SCOM3P1R_SCOM3P1_RPB12_Val      _UINT32_(0xE)                                        /* (PPS_SCOM3P1R) RPB12  */
#define   PPS_SCOM3P1R_SCOM3P1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM3P1R) OFF  */
#define PPS_SCOM3P1R_SCOM3P1_RPA0             (PPS_SCOM3P1R_SCOM3P1_RPA0_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPA0 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPA4             (PPS_SCOM3P1R_SCOM3P1_RPA4_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPA4 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPA8             (PPS_SCOM3P1R_SCOM3P1_RPA8_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPA8 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPA12            (PPS_SCOM3P1R_SCOM3P1_RPA12_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPA12 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPB1             (PPS_SCOM3P1R_SCOM3P1_RPB1_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPB1 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPB5             (PPS_SCOM3P1R_SCOM3P1_RPB5_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPB5 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPB9             (PPS_SCOM3P1R_SCOM3P1_RPB9_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPB9 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPB13            (PPS_SCOM3P1R_SCOM3P1_RPB13_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPB13 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPA3             (PPS_SCOM3P1R_SCOM3P1_RPA3_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPA3 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPA7             (PPS_SCOM3P1R_SCOM3P1_RPA7_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPA7 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPA11            (PPS_SCOM3P1R_SCOM3P1_RPA11_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPA11 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPB0             (PPS_SCOM3P1R_SCOM3P1_RPB0_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPB0 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPB4             (PPS_SCOM3P1R_SCOM3P1_RPB4_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPB4 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPB8             (PPS_SCOM3P1R_SCOM3P1_RPB8_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPB8 Position  */
#define PPS_SCOM3P1R_SCOM3P1_RPB12            (PPS_SCOM3P1R_SCOM3P1_RPB12_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) RPB12 Position  */
#define PPS_SCOM3P1R_SCOM3P1_OFF              (PPS_SCOM3P1R_SCOM3P1_OFF_Val << PPS_SCOM3P1R_SCOM3P1_Pos) /* (PPS_SCOM3P1R) OFF Position  */
#define PPS_SCOM3P1R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM3P1R) Register Mask  */


/* -------- PPS_SCOM3P2R : (PPS Offset: 0x78) (R/W 32)  -------- */
#define PPS_SCOM3P2R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM3P2R)   Reset Value */

#define PPS_SCOM3P2R_SCOM3P2_Pos              _UINT32_(0)                                          /* (PPS_SCOM3P2R) SERCOM3/PAD2 Position */
#define PPS_SCOM3P2R_SCOM3P2_Msk              (_UINT32_(0xF) << PPS_SCOM3P2R_SCOM3P2_Pos)          /* (PPS_SCOM3P2R) SERCOM3/PAD2 Mask */
#define PPS_SCOM3P2R_SCOM3P2(value)           (PPS_SCOM3P2R_SCOM3P2_Msk & (_UINT32_(value) << PPS_SCOM3P2R_SCOM3P2_Pos)) /* Assigment of value for SCOM3P2 in the PPS_SCOM3P2R register */
#define   PPS_SCOM3P2R_SCOM3P2_RPA1_Val       _UINT32_(0xF)                                        /* (PPS_SCOM3P2R) RPA1  */
#define   PPS_SCOM3P2R_SCOM3P2_RPA5_Val       _UINT32_(0x1)                                        /* (PPS_SCOM3P2R) RPA5  */
#define   PPS_SCOM3P2R_SCOM3P2_RPA9_Val       _UINT32_(0x2)                                        /* (PPS_SCOM3P2R) RPA9  */
#define   PPS_SCOM3P2R_SCOM3P2_RPA13_Val      _UINT32_(0x3)                                        /* (PPS_SCOM3P2R) RPA13  */
#define   PPS_SCOM3P2R_SCOM3P2_RPB2_Val       _UINT32_(0x4)                                        /* (PPS_SCOM3P2R) RPB2  */
#define   PPS_SCOM3P2R_SCOM3P2_RPB6_Val       _UINT32_(0x5)                                        /* (PPS_SCOM3P2R) RPB6  */
#define   PPS_SCOM3P2R_SCOM3P2_RPB10_Val      _UINT32_(0x6)                                        /* (PPS_SCOM3P2R) RPB10  */
#define   PPS_SCOM3P2R_SCOM3P2_RPA0_Val       _UINT32_(0x7)                                        /* (PPS_SCOM3P2R) RPA0  */
#define   PPS_SCOM3P2R_SCOM3P2_RPA4_Val       _UINT32_(0x8)                                        /* (PPS_SCOM3P2R) RPA4  */
#define   PPS_SCOM3P2R_SCOM3P2_RPA8_Val       _UINT32_(0x9)                                        /* (PPS_SCOM3P2R) RPA8  */
#define   PPS_SCOM3P2R_SCOM3P2_RPA12_Val      _UINT32_(0xA)                                        /* (PPS_SCOM3P2R) RPA12  */
#define   PPS_SCOM3P2R_SCOM3P2_RPB1_Val       _UINT32_(0xB)                                        /* (PPS_SCOM3P2R) RPB1  */
#define   PPS_SCOM3P2R_SCOM3P2_RPB5_Val       _UINT32_(0xC)                                        /* (PPS_SCOM3P2R) RPB5  */
#define   PPS_SCOM3P2R_SCOM3P2_RPB9_Val       _UINT32_(0xD)                                        /* (PPS_SCOM3P2R) RPB9  */
#define   PPS_SCOM3P2R_SCOM3P2_RPB13_Val      _UINT32_(0xE)                                        /* (PPS_SCOM3P2R) RPB13  */
#define   PPS_SCOM3P2R_SCOM3P2_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM3P2R) OFF  */
#define PPS_SCOM3P2R_SCOM3P2_RPA1             (PPS_SCOM3P2R_SCOM3P2_RPA1_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPA1 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPA5             (PPS_SCOM3P2R_SCOM3P2_RPA5_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPA5 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPA9             (PPS_SCOM3P2R_SCOM3P2_RPA9_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPA9 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPA13            (PPS_SCOM3P2R_SCOM3P2_RPA13_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPA13 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPB2             (PPS_SCOM3P2R_SCOM3P2_RPB2_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPB2 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPB6             (PPS_SCOM3P2R_SCOM3P2_RPB6_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPB6 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPB10            (PPS_SCOM3P2R_SCOM3P2_RPB10_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPB10 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPA0             (PPS_SCOM3P2R_SCOM3P2_RPA0_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPA0 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPA4             (PPS_SCOM3P2R_SCOM3P2_RPA4_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPA4 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPA8             (PPS_SCOM3P2R_SCOM3P2_RPA8_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPA8 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPA12            (PPS_SCOM3P2R_SCOM3P2_RPA12_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPA12 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPB1             (PPS_SCOM3P2R_SCOM3P2_RPB1_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPB1 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPB5             (PPS_SCOM3P2R_SCOM3P2_RPB5_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPB5 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPB9             (PPS_SCOM3P2R_SCOM3P2_RPB9_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPB9 Position  */
#define PPS_SCOM3P2R_SCOM3P2_RPB13            (PPS_SCOM3P2R_SCOM3P2_RPB13_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) RPB13 Position  */
#define PPS_SCOM3P2R_SCOM3P2_OFF              (PPS_SCOM3P2R_SCOM3P2_OFF_Val << PPS_SCOM3P2R_SCOM3P2_Pos) /* (PPS_SCOM3P2R) OFF Position  */
#define PPS_SCOM3P2R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM3P2R) Register Mask  */


/* -------- PPS_SCOM3P3R : (PPS Offset: 0x7C) (R/W 32)  -------- */
#define PPS_SCOM3P3R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM3P3R)   Reset Value */

