MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/pps.h
/* -------- PPS_TC0WO0G1R : (PPS Offset: 0xB0) (R/W 32)  -------- */
#define PPS_TC0WO0G1R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC0WO0G1R)   Reset Value */

#define PPS_TC0WO0G1R_TC0WO0_Pos              _UINT32_(0)                                          /* (PPS_TC0WO0G1R) TC0/WO0G1 Position */
#define PPS_TC0WO0G1R_TC0WO0_Msk              (_UINT32_(0xF) << PPS_TC0WO0G1R_TC0WO0_Pos)          /* (PPS_TC0WO0G1R) TC0/WO0G1 Mask */
#define PPS_TC0WO0G1R_TC0WO0(value)           (PPS_TC0WO0G1R_TC0WO0_Msk & (_UINT32_(value) << PPS_TC0WO0G1R_TC0WO0_Pos)) /* Assigment of value for TC0WO0 in the PPS_TC0WO0G1R register */
#define   PPS_TC0WO0G1R_TC0WO0_RPA9_Val       _UINT32_(0xF)                                        /* (PPS_TC0WO0G1R) RPA9  */
#define   PPS_TC0WO0G1R_TC0WO0_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_TC0WO0G1R) RPA3  */
#define   PPS_TC0WO0G1R_TC0WO0_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_TC0WO0G1R) RPA7  */
#define   PPS_TC0WO0G1R_TC0WO0_RPA11_Val      _UINT32_(0x3)                                        /* (PPS_TC0WO0G1R) RPA11  */
#define   PPS_TC0WO0G1R_TC0WO0_RPB0_Val       _UINT32_(0x4)                                        /* (PPS_TC0WO0G1R) RPB0  */
#define   PPS_TC0WO0G1R_TC0WO0_RPB4_Val       _UINT32_(0x5)                                        /* (PPS_TC0WO0G1R) RPB4  */
#define   PPS_TC0WO0G1R_TC0WO0_RPB8_Val       _UINT32_(0x6)                                        /* (PPS_TC0WO0G1R) RPB8  */
#define   PPS_TC0WO0G1R_TC0WO0_RPB12_Val      _UINT32_(0x7)                                        /* (PPS_TC0WO0G1R) RPB12  */
#define   PPS_TC0WO0G1R_TC0WO0_RPA2_Val       _UINT32_(0x8)                                        /* (PPS_TC0WO0G1R) RPA2  */
#define   PPS_TC0WO0G1R_TC0WO0_RPA6_Val       _UINT32_(0x9)                                        /* (PPS_TC0WO0G1R) RPA6  */
#define   PPS_TC0WO0G1R_TC0WO0_RPA10_Val      _UINT32_(0xA)                                        /* (PPS_TC0WO0G1R) RPA10  */
#define   PPS_TC0WO0G1R_TC0WO0_RPA14_Val      _UINT32_(0xB)                                        /* (PPS_TC0WO0G1R) RPA14  */
#define   PPS_TC0WO0G1R_TC0WO0_RPB3_Val       _UINT32_(0xC)                                        /* (PPS_TC0WO0G1R) RPB3  */
#define   PPS_TC0WO0G1R_TC0WO0_RPB7_Val       _UINT32_(0xD)                                        /* (PPS_TC0WO0G1R) RPB7  */
#define   PPS_TC0WO0G1R_TC0WO0_RPB11_Val      _UINT32_(0xE)                                        /* (PPS_TC0WO0G1R) RPB11  */
#define   PPS_TC0WO0G1R_TC0WO0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC0WO0G1R) OFF  */
#define PPS_TC0WO0G1R_TC0WO0_RPA9             (PPS_TC0WO0G1R_TC0WO0_RPA9_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA9 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPA3             (PPS_TC0WO0G1R_TC0WO0_RPA3_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA3 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPA7             (PPS_TC0WO0G1R_TC0WO0_RPA7_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA7 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPA11            (PPS_TC0WO0G1R_TC0WO0_RPA11_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA11 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPB0             (PPS_TC0WO0G1R_TC0WO0_RPB0_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPB0 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPB4             (PPS_TC0WO0G1R_TC0WO0_RPB4_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPB4 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPB8             (PPS_TC0WO0G1R_TC0WO0_RPB8_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPB8 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPB12            (PPS_TC0WO0G1R_TC0WO0_RPB12_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPB12 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPA2             (PPS_TC0WO0G1R_TC0WO0_RPA2_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA2 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPA6             (PPS_TC0WO0G1R_TC0WO0_RPA6_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA6 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPA10            (PPS_TC0WO0G1R_TC0WO0_RPA10_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA10 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPA14            (PPS_TC0WO0G1R_TC0WO0_RPA14_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA14 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPB3             (PPS_TC0WO0G1R_TC0WO0_RPB3_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPB3 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPB7             (PPS_TC0WO0G1R_TC0WO0_RPB7_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPB7 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPB11            (PPS_TC0WO0G1R_TC0WO0_RPB11_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPB11 Position  */
#define PPS_TC0WO0G1R_TC0WO0_OFF              (PPS_TC0WO0G1R_TC0WO0_OFF_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) OFF Position  */
#define PPS_TC0WO0G1R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC0WO0G1R) Register Mask  */


/* -------- PPS_TC0WO0G2R : (PPS Offset: 0xB4) (R/W 32)  -------- */
#define PPS_TC0WO0G2R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC0WO0G2R)   Reset Value */

#define PPS_TC0WO0G2R_TC0WO0_Pos              _UINT32_(0)                                          /* (PPS_TC0WO0G2R) TC0/WO0G2 Position */
#define PPS_TC0WO0G2R_TC0WO0_Msk              (_UINT32_(0xF) << PPS_TC0WO0G2R_TC0WO0_Pos)          /* (PPS_TC0WO0G2R) TC0/WO0G2 Mask */
#define PPS_TC0WO0G2R_TC0WO0(value)           (PPS_TC0WO0G2R_TC0WO0_Msk & (_UINT32_(value) << PPS_TC0WO0G2R_TC0WO0_Pos)) /* Assigment of value for TC0WO0 in the PPS_TC0WO0G2R register */
#define   PPS_TC0WO0G2R_TC0WO0_RPA0_Val       _UINT32_(0xF)                                        /* (PPS_TC0WO0G2R) RPA0  */
#define   PPS_TC0WO0G2R_TC0WO0_RPA4_Val       _UINT32_(0x1)                                        /* (PPS_TC0WO0G2R) RPA4  */
#define   PPS_TC0WO0G2R_TC0WO0_RPA8_Val       _UINT32_(0x2)                                        /* (PPS_TC0WO0G2R) RPA8  */
#define   PPS_TC0WO0G2R_TC0WO0_RPA12_Val      _UINT32_(0x3)                                        /* (PPS_TC0WO0G2R) RPA12  */
#define   PPS_TC0WO0G2R_TC0WO0_RPB1_Val       _UINT32_(0x4)                                        /* (PPS_TC0WO0G2R) RPB1  */
#define   PPS_TC0WO0G2R_TC0WO0_RPB5_Val       _UINT32_(0x5)                                        /* (PPS_TC0WO0G2R) RPB5  */
#define   PPS_TC0WO0G2R_TC0WO0_RPB9_Val       _UINT32_(0x6)                                        /* (PPS_TC0WO0G2R) RPB9  */
#define   PPS_TC0WO0G2R_TC0WO0_RPB13_Val      _UINT32_(0x7)                                        /* (PPS_TC0WO0G2R) RPB13  */
#define   PPS_TC0WO0G2R_TC0WO0_RPA3_Val       _UINT32_(0x8)                                        /* (PPS_TC0WO0G2R) RPA3  */
#define   PPS_TC0WO0G2R_TC0WO0_RPA7_Val       _UINT32_(0x9)                                        /* (PPS_TC0WO0G2R) RPA7  */
#define   PPS_TC0WO0G2R_TC0WO0_RPA11_Val      _UINT32_(0xA)                                        /* (PPS_TC0WO0G2R) RPA11  */
#define   PPS_TC0WO0G2R_TC0WO0_RPB0_Val       _UINT32_(0xB)                                        /* (PPS_TC0WO0G2R) RPB0  */
#define   PPS_TC0WO0G2R_TC0WO0_RPB4_Val       _UINT32_(0xC)                                        /* (PPS_TC0WO0G2R) RPB4  */
#define   PPS_TC0WO0G2R_TC0WO0_RPB8_Val       _UINT32_(0xD)                                        /* (PPS_TC0WO0G2R) RPB8  */
#define   PPS_TC0WO0G2R_TC0WO0_RPB12_Val      _UINT32_(0xE)                                        /* (PPS_TC0WO0G2R) RPB12  */
#define   PPS_TC0WO0G2R_TC0WO0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC0WO0G2R) OFF  */
#define PPS_TC0WO0G2R_TC0WO0_RPA0             (PPS_TC0WO0G2R_TC0WO0_RPA0_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPA0 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPA4             (PPS_TC0WO0G2R_TC0WO0_RPA4_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPA4 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPA8             (PPS_TC0WO0G2R_TC0WO0_RPA8_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPA8 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPA12            (PPS_TC0WO0G2R_TC0WO0_RPA12_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPA12 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPB1             (PPS_TC0WO0G2R_TC0WO0_RPB1_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPB1 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPB5             (PPS_TC0WO0G2R_TC0WO0_RPB5_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPB5 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPB9             (PPS_TC0WO0G2R_TC0WO0_RPB9_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPB9 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPB13            (PPS_TC0WO0G2R_TC0WO0_RPB13_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPB13 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPA3             (PPS_TC0WO0G2R_TC0WO0_RPA3_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPA3 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPA7             (PPS_TC0WO0G2R_TC0WO0_RPA7_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPA7 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPA11            (PPS_TC0WO0G2R_TC0WO0_RPA11_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPA11 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPB0             (PPS_TC0WO0G2R_TC0WO0_RPB0_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPB0 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPB4             (PPS_TC0WO0G2R_TC0WO0_RPB4_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPB4 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPB8             (PPS_TC0WO0G2R_TC0WO0_RPB8_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPB8 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPB12            (PPS_TC0WO0G2R_TC0WO0_RPB12_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPB12 Position  */
#define PPS_TC0WO0G2R_TC0WO0_OFF              (PPS_TC0WO0G2R_TC0WO0_OFF_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) OFF Position  */
#define PPS_TC0WO0G2R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC0WO0G2R) Register Mask  */


/* -------- PPS_TC0WO1G3R : (PPS Offset: 0xB8) (R/W 32)  -------- */
#define PPS_TC0WO1G3R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC0WO1G3R)   Reset Value */

#define PPS_TC0WO1G3R_TC0WO1_Pos              _UINT32_(0)                                          /* (PPS_TC0WO1G3R) TC0/WO1G3 Position */
#define PPS_TC0WO1G3R_TC0WO1_Msk              (_UINT32_(0xF) << PPS_TC0WO1G3R_TC0WO1_Pos)          /* (PPS_TC0WO1G3R) TC0/WO1G3 Mask */
#define PPS_TC0WO1G3R_TC0WO1(value)           (PPS_TC0WO1G3R_TC0WO1_Msk & (_UINT32_(value) << PPS_TC0WO1G3R_TC0WO1_Pos)) /* Assigment of value for TC0WO1 in the PPS_TC0WO1G3R register */
#define   PPS_TC0WO1G3R_TC0WO1_RPA1_Val       _UINT32_(0xF)                                        /* (PPS_TC0WO1G3R) RPA1  */
#define   PPS_TC0WO1G3R_TC0WO1_RPA5_Val       _UINT32_(0x1)                                        /* (PPS_TC0WO1G3R) RPA5  */
#define   PPS_TC0WO1G3R_TC0WO1_RPA9_Val       _UINT32_(0x2)                                        /* (PPS_TC0WO1G3R) RPA9  */
#define   PPS_TC0WO1G3R_TC0WO1_RPA13_Val      _UINT32_(0x3)                                        /* (PPS_TC0WO1G3R) RPA13  */
#define   PPS_TC0WO1G3R_TC0WO1_RPB2_Val       _UINT32_(0x4)                                        /* (PPS_TC0WO1G3R) RPB2  */
#define   PPS_TC0WO1G3R_TC0WO1_RPB6_Val       _UINT32_(0x5)                                        /* (PPS_TC0WO1G3R) RPB6  */
#define   PPS_TC0WO1G3R_TC0WO1_RPB10_Val      _UINT32_(0x6)                                        /* (PPS_TC0WO1G3R) RPB10  */
#define   PPS_TC0WO1G3R_TC0WO1_RPA0_Val       _UINT32_(0x7)                                        /* (PPS_TC0WO1G3R) RPA0  */
#define   PPS_TC0WO1G3R_TC0WO1_RPA4_Val       _UINT32_(0x8)                                        /* (PPS_TC0WO1G3R) RPA4  */
#define   PPS_TC0WO1G3R_TC0WO1_RPA8_Val       _UINT32_(0x9)                                        /* (PPS_TC0WO1G3R) RPA8  */
#define   PPS_TC0WO1G3R_TC0WO1_RPA12_Val      _UINT32_(0xA)                                        /* (PPS_TC0WO1G3R) RPA12  */
#define   PPS_TC0WO1G3R_TC0WO1_RPB1_Val       _UINT32_(0xB)                                        /* (PPS_TC0WO1G3R) RPB1  */
#define   PPS_TC0WO1G3R_TC0WO1_RPB5_Val       _UINT32_(0xC)                                        /* (PPS_TC0WO1G3R) RPB5  */
#define   PPS_TC0WO1G3R_TC0WO1_RPB9_Val       _UINT32_(0xD)                                        /* (PPS_TC0WO1G3R) RPB9  */
#define   PPS_TC0WO1G3R_TC0WO1_RPB13_Val      _UINT32_(0xE)                                        /* (PPS_TC0WO1G3R) RPB13  */
#define   PPS_TC0WO1G3R_TC0WO1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC0WO1G3R) OFF  */
#define PPS_TC0WO1G3R_TC0WO1_RPA1             (PPS_TC0WO1G3R_TC0WO1_RPA1_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPA1 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPA5             (PPS_TC0WO1G3R_TC0WO1_RPA5_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPA5 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPA9             (PPS_TC0WO1G3R_TC0WO1_RPA9_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPA9 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPA13            (PPS_TC0WO1G3R_TC0WO1_RPA13_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPA13 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPB2             (PPS_TC0WO1G3R_TC0WO1_RPB2_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPB2 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPB6             (PPS_TC0WO1G3R_TC0WO1_RPB6_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPB6 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPB10            (PPS_TC0WO1G3R_TC0WO1_RPB10_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPB10 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPA0             (PPS_TC0WO1G3R_TC0WO1_RPA0_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPA0 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPA4             (PPS_TC0WO1G3R_TC0WO1_RPA4_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPA4 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPA8             (PPS_TC0WO1G3R_TC0WO1_RPA8_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPA8 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPA12            (PPS_TC0WO1G3R_TC0WO1_RPA12_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPA12 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPB1             (PPS_TC0WO1G3R_TC0WO1_RPB1_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPB1 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPB5             (PPS_TC0WO1G3R_TC0WO1_RPB5_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPB5 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPB9             (PPS_TC0WO1G3R_TC0WO1_RPB9_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPB9 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPB13            (PPS_TC0WO1G3R_TC0WO1_RPB13_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPB13 Position  */
#define PPS_TC0WO1G3R_TC0WO1_OFF              (PPS_TC0WO1G3R_TC0WO1_OFF_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) OFF Position  */
#define PPS_TC0WO1G3R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC0WO1G3R) Register Mask  */


