MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/pps.h
#define PPS_RPB13G3R_RPB13G3R_Pos             _UINT32_(0)                                          /* (PPS_RPB13G3R) RPB13/G3 Position */
#define PPS_RPB13G3R_RPB13G3R_Msk             (_UINT32_(0x1F) << PPS_RPB13G3R_RPB13G3R_Pos)        /* (PPS_RPB13G3R) RPB13/G3 Mask */
#define PPS_RPB13G3R_RPB13G3R(value)          (PPS_RPB13G3R_RPB13G3R_Msk & (_UINT32_(value) << PPS_RPB13G3R_RPB13G3R_Pos)) /* Assigment of value for RPB13G3R in the PPS_RPB13G3R register */
#define   PPS_RPB13G3R_RPB13G3R_OFF_Val       _UINT32_(0x0)                                        /* (PPS_RPB13G3R) OFF  */
#define   PPS_RPB13G3R_RPB13G3R_SCOM0P1_Val   _UINT32_(0x1)                                        /* (PPS_RPB13G3R) SERCOM0/PAD1  */
#define   PPS_RPB13G3R_RPB13G3R_SCOM0P0_Val   _UINT32_(0x2)                                        /* (PPS_RPB13G3R) SERCOM0/PAD0  */
#define   PPS_RPB13G3R_RPB13G3R_SCOM0P3_Val   _UINT32_(0x3)                                        /* (PPS_RPB13G3R) SERCOM0/PAD3  */
#define   PPS_RPB13G3R_RPB13G3R_SCOM1P2_Val   _UINT32_(0x4)                                        /* (PPS_RPB13G3R) SERCOM1/PAD2  */
#define   PPS_RPB13G3R_RPB13G3R_SCOM1P0_Val   _UINT32_(0x5)                                        /* (PPS_RPB13G3R) SERCOM1/PAD0  */
#define   PPS_RPB13G3R_RPB13G3R_SCOM1P3_Val   _UINT32_(0x6)                                        /* (PPS_RPB13G3R) SERCOM1/PAD3  */
#define   PPS_RPB13G3R_RPB13G3R_SCOM2P2_Val   _UINT32_(0x7)                                        /* (PPS_RPB13G3R) SERCOM2/PAD2  */
#define   PPS_RPB13G3R_RPB13G3R_SCOM2P3_Val   _UINT32_(0x8)                                        /* (PPS_RPB13G3R) SERCOM2/PAD3  */
#define   PPS_RPB13G3R_RPB13G3R_SCOM3P2_Val   _UINT32_(0x9)                                        /* (PPS_RPB13G3R) SERCOM3/PAD2  */
#define   PPS_RPB13G3R_RPB13G3R_SCOM3P1_Val   _UINT32_(0xA)                                        /* (PPS_RPB13G3R) SERCOM3/PAD1  */
#define   PPS_RPB13G3R_RPB13G3R_TCC0WO2_Val   _UINT32_(0xB)                                        /* (PPS_RPB13G3R) TCC0/WO2  */
#define   PPS_RPB13G3R_RPB13G3R_TCC0WO0_Val   _UINT32_(0xC)                                        /* (PPS_RPB13G3R) TCC0/WO0  */
#define   PPS_RPB13G3R_RPB13G3R_TCC0WO4_Val   _UINT32_(0xD)                                        /* (PPS_RPB13G3R) TCC0/WO4  */
#define   PPS_RPB13G3R_RPB13G3R_TCC1WO2_Val   _UINT32_(0xE)                                        /* (PPS_RPB13G3R) TCC1/WO2  */
#define   PPS_RPB13G3R_RPB13G3R_TCC1WO0_Val   _UINT32_(0xF)                                        /* (PPS_RPB13G3R) TCC1/WO0  */
#define   PPS_RPB13G3R_RPB13G3R_TCC1WO4_Val   _UINT32_(0x10)                                       /* (PPS_RPB13G3R) TCC1/WO4  */
#define   PPS_RPB13G3R_RPB13G3R_TCC2WO0_Val   _UINT32_(0x11)                                       /* (PPS_RPB13G3R) TCC2/WO0  */
#define   PPS_RPB13G3R_RPB13G3R_TC0WO0_Val    _UINT32_(0x12)                                       /* (PPS_RPB13G3R) TC0/WO0  */
#define   PPS_RPB13G3R_RPB13G3R_REFO3_Val     _UINT32_(0x13)                                       /* (PPS_RPB13G3R) REFO3  */
#define   PPS_RPB13G3R_RPB13G3R_TC1WO0_Val    _UINT32_(0x14)                                       /* (PPS_RPB13G3R) TC1/WO0  */
#define   PPS_RPB13G3R_RPB13G3R_TC2WO0_Val    _UINT32_(0x15)                                       /* (PPS_RPB13G3R) TC2/WO0  */
#define   PPS_RPB13G3R_RPB13G3R_TC3WO0_Val    _UINT32_(0x16)                                       /* (PPS_RPB13G3R) TC3/WO0  */
#define   PPS_RPB13G3R_RPB13G3R_QSCK_Val      _UINT32_(0x17)                                       /* (PPS_RPB13G3R) QSCK  */
#define   PPS_RPB13G3R_RPB13G3R_QCS_Val       _UINT32_(0x18)                                       /* (PPS_RPB13G3R) QCS  */
#define   PPS_RPB13G3R_RPB13G3R_QD1_Val       _UINT32_(0x19)                                       /* (PPS_RPB13G3R) QD1  */
#define   PPS_RPB13G3R_RPB13G3R_QD0_Val       _UINT32_(0x1A)                                       /* (PPS_RPB13G3R) QD0  */
#define   PPS_RPB13G3R_RPB13G3R_QD3_Val       _UINT32_(0x1B)                                       /* (PPS_RPB13G3R) QD3  */
#define   PPS_RPB13G3R_RPB13G3R_CCLOUT0_Val   _UINT32_(0x1C)                                       /* (PPS_RPB13G3R) CCLOUT0  */
#define   PPS_RPB13G3R_RPB13G3R_TSTBUS2_Val   _UINT32_(0x1D)                                       /* (PPS_RPB13G3R) TSTBUS2  */
#define   PPS_RPB13G3R_RPB13G3R_TSTBUS6_Val   _UINT32_(0x1E)                                       /* (PPS_RPB13G3R) TSTBUS6  */
#define   PPS_RPB13G3R_RPB13G3R_TSTBUS10_Val  _UINT32_(0x1F)                                       /* (PPS_RPB13G3R) TSTBUS10  */
#define PPS_RPB13G3R_RPB13G3R_OFF             (PPS_RPB13G3R_RPB13G3R_OFF_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) OFF Position  */
#define PPS_RPB13G3R_RPB13G3R_SCOM0P1         (PPS_RPB13G3R_RPB13G3R_SCOM0P1_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) SERCOM0/PAD1 Position  */
#define PPS_RPB13G3R_RPB13G3R_SCOM0P0         (PPS_RPB13G3R_RPB13G3R_SCOM0P0_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) SERCOM0/PAD0 Position  */
#define PPS_RPB13G3R_RPB13G3R_SCOM0P3         (PPS_RPB13G3R_RPB13G3R_SCOM0P3_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) SERCOM0/PAD3 Position  */
#define PPS_RPB13G3R_RPB13G3R_SCOM1P2         (PPS_RPB13G3R_RPB13G3R_SCOM1P2_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) SERCOM1/PAD2 Position  */
#define PPS_RPB13G3R_RPB13G3R_SCOM1P0         (PPS_RPB13G3R_RPB13G3R_SCOM1P0_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) SERCOM1/PAD0 Position  */
#define PPS_RPB13G3R_RPB13G3R_SCOM1P3         (PPS_RPB13G3R_RPB13G3R_SCOM1P3_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) SERCOM1/PAD3 Position  */
#define PPS_RPB13G3R_RPB13G3R_SCOM2P2         (PPS_RPB13G3R_RPB13G3R_SCOM2P2_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) SERCOM2/PAD2 Position  */
#define PPS_RPB13G3R_RPB13G3R_SCOM2P3         (PPS_RPB13G3R_RPB13G3R_SCOM2P3_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) SERCOM2/PAD3 Position  */
#define PPS_RPB13G3R_RPB13G3R_SCOM3P2         (PPS_RPB13G3R_RPB13G3R_SCOM3P2_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) SERCOM3/PAD2 Position  */
#define PPS_RPB13G3R_RPB13G3R_SCOM3P1         (PPS_RPB13G3R_RPB13G3R_SCOM3P1_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) SERCOM3/PAD1 Position  */
#define PPS_RPB13G3R_RPB13G3R_TCC0WO2         (PPS_RPB13G3R_RPB13G3R_TCC0WO2_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TCC0/WO2 Position  */
#define PPS_RPB13G3R_RPB13G3R_TCC0WO0         (PPS_RPB13G3R_RPB13G3R_TCC0WO0_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TCC0/WO0 Position  */
#define PPS_RPB13G3R_RPB13G3R_TCC0WO4         (PPS_RPB13G3R_RPB13G3R_TCC0WO4_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TCC0/WO4 Position  */
#define PPS_RPB13G3R_RPB13G3R_TCC1WO2         (PPS_RPB13G3R_RPB13G3R_TCC1WO2_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TCC1/WO2 Position  */
#define PPS_RPB13G3R_RPB13G3R_TCC1WO0         (PPS_RPB13G3R_RPB13G3R_TCC1WO0_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TCC1/WO0 Position  */
#define PPS_RPB13G3R_RPB13G3R_TCC1WO4         (PPS_RPB13G3R_RPB13G3R_TCC1WO4_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TCC1/WO4 Position  */
#define PPS_RPB13G3R_RPB13G3R_TCC2WO0         (PPS_RPB13G3R_RPB13G3R_TCC2WO0_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TCC2/WO0 Position  */
#define PPS_RPB13G3R_RPB13G3R_TC0WO0          (PPS_RPB13G3R_RPB13G3R_TC0WO0_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TC0/WO0 Position  */
#define PPS_RPB13G3R_RPB13G3R_REFO3           (PPS_RPB13G3R_RPB13G3R_REFO3_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) REFO3 Position  */
#define PPS_RPB13G3R_RPB13G3R_TC1WO0          (PPS_RPB13G3R_RPB13G3R_TC1WO0_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TC1/WO0 Position  */
#define PPS_RPB13G3R_RPB13G3R_TC2WO0          (PPS_RPB13G3R_RPB13G3R_TC2WO0_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TC2/WO0 Position  */
#define PPS_RPB13G3R_RPB13G3R_TC3WO0          (PPS_RPB13G3R_RPB13G3R_TC3WO0_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TC3/WO0 Position  */
#define PPS_RPB13G3R_RPB13G3R_QSCK            (PPS_RPB13G3R_RPB13G3R_QSCK_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) QSCK Position  */
#define PPS_RPB13G3R_RPB13G3R_QCS             (PPS_RPB13G3R_RPB13G3R_QCS_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) QCS Position  */
#define PPS_RPB13G3R_RPB13G3R_QD1             (PPS_RPB13G3R_RPB13G3R_QD1_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) QD1 Position  */
#define PPS_RPB13G3R_RPB13G3R_QD0             (PPS_RPB13G3R_RPB13G3R_QD0_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) QD0 Position  */
#define PPS_RPB13G3R_RPB13G3R_QD3             (PPS_RPB13G3R_RPB13G3R_QD3_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) QD3 Position  */
#define PPS_RPB13G3R_RPB13G3R_CCLOUT0         (PPS_RPB13G3R_RPB13G3R_CCLOUT0_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) CCLOUT0 Position  */
#define PPS_RPB13G3R_RPB13G3R_TSTBUS2         (PPS_RPB13G3R_RPB13G3R_TSTBUS2_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TSTBUS2 Position  */
#define PPS_RPB13G3R_RPB13G3R_TSTBUS6         (PPS_RPB13G3R_RPB13G3R_TSTBUS6_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TSTBUS6 Position  */
#define PPS_RPB13G3R_RPB13G3R_TSTBUS10        (PPS_RPB13G3R_RPB13G3R_TSTBUS10_Val << PPS_RPB13G3R_RPB13G3R_Pos) /* (PPS_RPB13G3R) TSTBUS10 Position  */
#define PPS_RPB13G3R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_RPB13G3R) Register Mask  */


